backend: tensorflow
class_name: Functional
config:
  input_layers:
  - - inputs
    - 0
    - 0
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - 150
      dtype: float32
      name: inputs
      ragged: false
      sparse: false
    inbound_nodes: []
    name: inputs
  - class_name: Embedding
    config:
      activity_regularizer: null
      batch_input_shape: !!python/tuple
      - null
      - 150
      dtype: float32
      embeddings_constraint: null
      embeddings_initializer:
        class_name: RandomUniform
        config:
          maxval: 0.05
          minval: -0.05
          seed: null
      embeddings_regularizer: null
      input_dim: 1000
      input_length: 150
      mask_zero: false
      name: embedding_1
      output_dim: 50
      trainable: true
    inbound_nodes:
    - - - inputs
        - 0
        - 0
        - {}
    name: embedding_1
  - class_name: LSTM
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      dtype: float32
      go_backwards: false
      implementation: 2
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: lstm_1
      recurrent_activation: sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config:
          gain: 1.0
          seed: null
      recurrent_regularizer: null
      return_sequences: false
      return_state: false
      stateful: false
      time_major: false
      trainable: true
      unit_forget_bias: true
      units: 64
      unroll: false
      use_bias: true
    inbound_nodes:
    - - - embedding_1
        - 0
        - 0
        - {}
    name: lstm_1
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: FC1
      trainable: true
      units: 256
      use_bias: true
    inbound_nodes:
    - - - lstm_1
        - 0
        - 0
        - {}
    name: FC1
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_2
      trainable: true
    inbound_nodes:
    - - - FC1
        - 0
        - 0
        - {}
    name: activation_2
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout_1
      noise_shape: null
      rate: 0.2
      seed: null
      trainable: true
    inbound_nodes:
    - - - activation_2
        - 0
        - 0
        - {}
    name: dropout_1
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: out_layer
      trainable: true
      units: 1
      use_bias: true
    inbound_nodes:
    - - - dropout_1
        - 0
        - 0
        - {}
    name: out_layer
  - class_name: Activation
    config:
      activation: sigmoid
      dtype: float32
      name: activation_3
      trainable: true
    inbound_nodes:
    - - - out_layer
        - 0
        - 0
        - {}
    name: activation_3
  name: model_1
  output_layers:
  - - activation_3
    - 0
    - 0
keras_version: 2.4.0
